Repository: Danicorsan/StopNow
Catalog: lib/l10n/app_*.arb
Languages: es

# inicio
source: Home
es: Inicio

# perfil
source: Profile
es: Perfil

# comunidad
source: Community
es: Comunidad

# objetivos
source: Goals
es: Objetivos

# logros
source: Achievements
es: Logros

# ajustes
source: Settings
es: Ajustes

# bienvenidoUsuario
source: Welcome, {nombre}
es: Bienvenido, {nombre}

# usuario
source: User
es: Usuario

# tiempoSinFumar
source: Time without smoking
es: Tiempo sin fumar

# anios
source: years
es: años

# meses
source: Months
es: Meses

# dias
source: Days
es: Días

# horas
source: Hours
es: Horas

# seg
source: Sec
es: Seg

# dineroAhorrado
source: Money saved
es: Dinero ahorrado

# cigarrosEvitados
source: Cigarettes avoided
es: Cigarros evitados

# tiempoDeVidaGanado
source: Life time gained
es: Tiempo de vida ganado

# teEncuentrasConGanasDeFumar
source: Do you feel like smoking?
es: ¿Te encuentras con ganas de fumar?

# pruebaConNuestroMetodoDeRelajacion
source: Try our relaxing method
es: Prueba con nuestro método de relajación

# metodoDeRelajacion
source: Relaxing method
es: Método de relajación

# hasDesbloqueadoLogros
source: You've unlocked {unlocked} out of {total} achievements!
es: ¡Has desbloqueado {unlocked} de {total} logros!

# errorDesconocido
source: Unknown error
es: Error desconocido

# conExito
source: Success!
es: ¡Con éxito!

# calma
source: Calm
es: Calma

# tecnica478
source: 4-7-8 Technique
es: Técnica 4-7-8

# iniciar
source: Start
es: Iniciar

# descripcionTecnica478
source: This breathing technique helps prevent hyperventilation and is used as a distraction method during moments of anxiety or stress. Inhale for 4 seconds, hold your breath for 7 seconds, and exhale for 8 seconds to calm the nervous system and reduce anxiety.
es: Esta respiración ayuda a prevenir la hiperventilación y se utiliza como técnica de distracción durante momentos de ansiedad o estrés. Inhalar durante 4 segundos, retener la respiración por 7 segundos y exhalar durante 8 segundos ayuda a calmar el sistema nervioso y a reducir la ansiedad.

# anadirObjetivo
source: Add goal
es: Añadir objetivo

# nombre
source: Name
es: Nombre

# introduceNombreObjetivo
source: Enter the goal name
es: Introduce el nombre del objetivo

# nombreMinimoCaracteres
source: The name must be at least 3 characters long
es: El nombre debe tener al menos 3 caracteres

# descripcion
source: Description
es: Descripción

# cuantoCuesta
source: How much does it cost?
es: ¿Cuánto cuesta?

# introduceNumeroValido
source: Enter a valid number
es: Introduce un número válido

# revisaCampos
source: Please check all fields
es: Por favor, revisa todos los campos

# estasAhorrandoPara
source: You're saving for:
es: Estás ahorrando para:

# precioObjetivo
source: Goal price: {precio} €
es: Precio objetivo: {precio} €

# ahorroCigarros
source: You have saved {dinero} € by avoiding {cigarros} cigarettes!
es: ¡Has ahorrado {dinero} € desde que añadiste el objetivo!

# dineroFaltante
source: Money remaining
es: Dinero que falta

# cigarrosFaltantes
source: Cigarettes remaining
es: Cigarros que faltan

# horasFaltantes
source: Hours remaining
es: Horas que faltan

# comoSeCalcula
source: How is it calculated?
es: ¿Cómo se calcula?

# explicacionCalculo1
source: Each cigarette you don't smoke saves you money and life time.
es: Cada cigarro que no fumas te ahorra dinero y tiempo de vida.

# explicacionCalculo2
source: The calculation is based on the price of your pack, the cigarettes you smoked per day, and the time remaining to meet it since you added the target.
es: El cálculo se basa en el precio de tu paquete, los cigarros que fumabas al día y el tiempo que falta para cumplirlo desde que añadiste el objetivo.

# sigueAsi
source: Keep it up! You're getting closer to your goal
es: ¡Sigue así! Estás cada vez más cerca de tu objetivo

# noTienesObjetivos
source: You have no goals yet
es: No tienes objetivos aún

# objetivoExito
source: Goal added successfully
es: Objetivo añadido con éxito

# errorObjetivo
source: Error adding the goal
es: Error al añadir el objetivo

# bienvenido
source: Welcome
es: Bienvenido

# correo
source: Email
es: Correo

# contrasenia
source: Password
es: Contraseña

# iniciarSesion
source: Sign in
es: Iniciar sesión

# noTienesCuenta
source: Don't have an account?
es: ¿No tienes cuenta?

# pinchaAqui
source: Click here
es: Pincha aquí

# noHayMensajes
source: No messages yet. Be the first to write!
es: No hay mensajes aún. ¡Sé el primero en escribir!

# escribeUnMensaje
source: Write a message
es: Escribe un mensaje

# miembroDesde
source: Member since: {anio}
es: Miembro desde: {anio}

# estadisticas
source: Statistics
es: Estadísticas

# diasSinFumar
source: Days without smoking:
es: Días sin fumar:

# cigarrosEvitadosEstadistica
source: Cigarettes avoided:
es: Cigarros evitados:

# dineroAhorradoEstadistica
source: Money saved:
es: Dinero ahorrado:

# tiempoVidaGanadoEstadistica
source: Life time gained:
es: Tiempo de vida ganado:

# logrosConseguidos
source: Achievements unlocked
es: Logros conseguidos

# sinLogros
source: You haven't unlocked any achievements yet. Keep going, every day counts
es: ¡Aún no has conseguido logros! Sigue adelante, cada día cuenta

# fotoDePerfil
source: Profile picture
es: Foto de perfil

# nombreUsuario
source: Username
es: Nombre de usuario

# introduceNombreUsuario
source: Enter a username
es: Introduce un nombre de usuario

# nombreUsuarioMinimo
source: The username must be at least 3 characters long
es: El nombre de usuario debe tener al menos 3 caracteres

# correoInvalido
source: Enter a valid email
es: Introduce un correo válido

# introduceContrasenia
source: Enter a password
es: Introduce una contraseña

# requisitosContrasenia
source: Must be 8 characters, uppercase, lowercase, and a number
es: Debe tener 8 caracteres, mayúscula, minúscula y número

# confirmarContrasenia
source: Confirm password
es: Confirmar contraseña

# contraseniasNoCoinciden
source: Passwords do not match
es: Las contraseñas no coinciden

# cigarrosPorDia
source: Cigarettes per day
es: Cigarros al día

# introduceCantidad
source: Enter the amount
es: Introduce la cantidad

# fechaDejarFumar
source: Quit smoking date
es: Fecha dejar de fumar

# introduceFecha
source: Enter a date
es: Introduce una fecha

# cigarrosPorPaquete
source: Cigarettes per pack
es: Cigarros por paquete

# precioPorPaquete
source: Pack price
es: Precio por paquete

# yaTienesCuenta
source: Already have an account?
es: ¿Ya tienes cuenta?

# cuenta
source: Account
es: Cuenta

# gestionaInformacion
source: Manage your personal information
es: Gestiona tu información personal

# recaida
source: Relapse
es: Recaída

# mensajeRecaida
source: Had a relapse? Restart your progress
es: ¿Tuviste una recaída? Reinicia tu progreso

# cerrarSesion
source: Log out
es: Cerrar sesión

# salirCuenta
source: Log out of your account
es: Salir de tu cuenta

# bienvenidoStopNow
source: Welcome to StopNow!
es: ¡Bienvenido a StopNow!

# crearCuenta
source: Create account
es: Crear cuenta

# logro_1_title
source: First Breath
es: Primer Respiro

# logro_1_desc
source: Blood pressure and heart rate decrease. Peripheral circulation improves.
es: Disminuyen la presión arterial y el ritmo cardíaco. La circulación periférica mejora.

# logro_2_title
source: Renewed Lungs
es: Pulmones Renovados

# logro_2_desc
source: Oxygen levels in the blood increase. Carbon monoxide in the blood decreases by half.
es: Los niveles de oxígeno en sangre aumentan. El monóxido de carbono en sangre disminuye a la mitad.

# logro_3_title
source: Clean Air
es: Aire Limpio

# logro_3_desc
source: Carbon monoxide is completely eliminated from the blood.
es: El monóxido de carbono se elimina por completo de la sangre.

# logro_4_title
source: Strong Heartbeat
es: Latido Fuerte

# logro_4_desc
source: The risk of heart attack decreases.
es: Disminuye el riesgo de sufrir un infarto.

# logro_5_title
source: Awakened Senses
es: Sentidos Despiertos

# logro_5_desc
source: Nerve endings begin to regenerate. Sense of smell and taste improve.
es: Comienzan a regenerarse las terminaciones nerviosas. Mejoran el olfato y el gusto.

# logro_6_title
source: Breathe Free
es: Respira Libre

# logro_6_desc
source: Bronchi begin to relax, breathing improves, and lung capacity increases.
es: Los bronquios comienzan a relajarse, mejora la respiración, y aumenta la capacidad pulmonar.

# logro_7_title
source: Clean Body
es: Cuerpo Limpio

# logro_7_desc
source: Nicotine has been almost completely eliminated from the body.
es: La nicotina ha sido eliminada casi completamente del cuerpo.

# logro_8_title
source: New Energy
es: Nueva Energía

# logro_8_desc
source: Physical withdrawal anxiety decreases. You start feeling more energetic.
es: Se reduce la ansiedad por la abstinencia física. Empiezas a notar más energía.

# logro_9_title
source: Fresh Breath
es: Aliento Renovado

# logro_9_desc
source: Breathing continues to improve and lungs are being cleaned.
es: Continúa mejorando la respiración y la limpieza pulmonar.

# logro_10_title
source: Life Flows
es: Fluye la Vida

# logro_10_desc
source: Significant improvement in blood circulation and lung function.
es: Mejora significativa de la circulación sanguínea y la función pulmonar.

# logro_11_title
source: Inner Strength
es: Fortaleza Interior

# logro_11_desc
source: Psychological dependence decreases. Better ability to handle stress without smoking.
es: Se reduce la dependencia psicológica. Mayor capacidad para manejar el estrés sin fumar.

# logro_12_title
source: Rebirth
es: Renacer

# logro_12_desc
source: Skin appearance improves. Cough and fatigue decrease. Immune system is strengthened.
es: La piel mejora su aspecto. Disminuyen la tos y la fatiga. Se refuerza el sistema inmune.

# logro_13_title
source: More Vitality
es: Más Vitalidad

# logro_13_desc
source: Notable improvement in the respiratory system and circulation. Greater physical endurance.
es: Mejora notable en el sistema respiratorio y la circulación. Más resistencia física.

# logro_14_title
source: Recovered Lungs
es: Pulmones Renovados

# logro_14_desc
source: Up to 30% of lung function is restored.
es: Se recupera hasta un 30% de la función pulmonar.

# logro_15_title
source: Goodbye Cough
es: Adiós a la Tos

# logro_15_desc
source: Coughing, congestion, and shortness of breath decrease significantly.
es: Disminuyen notablemente la tos, congestión, y dificultad respiratoria.

# logro_16_title
source: Strong Heart
es: Corazón Fuerte

# logro_16_desc
source: The risk of coronary heart disease is reduced by half.
es: El riesgo de enfermedad cardíaca coronaria se reduce a la mitad.

# logro_17_title
source: Clear Mind
es: Mente Clara

# logro_17_desc
source: The risk of stroke is equal to that of a non-smoker.
es: El riesgo de accidente cerebrovascular se iguala al de un no fumador.

# logro_18_title
source: Halfway There
es: Media Meta

# logro_18_desc
source: The risk of lung cancer is approximately half that of a smoker.
es: El riesgo de cáncer de pulmón es aproximadamente la mitad que el de un fumador.

# logro_19_title
source: Total Victory
es: Victoria Total

# logro_19_desc
source: The risk of cardiovascular disease is the same as that of someone who has never smoked.
es: El riesgo de enfermedad cardiovascular es igual al de una persona que nunca ha fumado.

# dialogoRecaida
source: This action will delete your progress. This action cant be reverted. ¿Are you sure?
es: Esta accion borrara tu progreso. Esta accion no se puede revertir. ¿Estas seguro?

# cancelar
source: Cancel
es: Cancelar

# aceptar
source: Accept
es: Aceptar

# cerrar
source: Close
es: Cerrar

# teQuedaParaDesbloquearlo
source: Time left to unlock it
es: Te queda para desbloquearlo

# yaDesbloqueado
source: Achievement unlocked!
es: ¡Logro desbloqueado!

# dejarasDeFumarEn
source: You will quit smoking in
es: Dejarás de fumar en

# fechaDeDejarFumar
source: Quit smoking date
es: Fecha para dejar de fumar

# segundos
source: seconds
es: segundos

# hoy
source: Today
es: Hoy

# ayer
source: Yesterday
es: Ayer

# cigarros
source: Cigarettes
es: Cigarros

# editarObjetivo
source: Edit goal
es: Editar Objetivo

# lecturas
source: Readings
es: Lecturas

# errorBorrarObjetivo
source: Could not delete the goal
es: No se pudo borrar el objetivo

# noHayArticulos
source: No articles available
es: No hay artículos disponibles

# permisoDenegado
source: Permission denied
es: Permiso denegado

# cuandoDejesDeFumar
source: When you have quit smoking, the information will appear here.
es: Cuando hayas dejado de fumar aparecerá aquí la información.

# usuarioNoHaDejadoFumar
source: This user has not quit smoking yet.
es: Este usuario aún no ha dejado de fumar.

# usuarioSinLogros
source: This user hasn't achieved any milestones yet.
es: Este usuario aún no ha conseguido logros.

# objetivoBorradoExito
source: Goal successfully deleted
es: Objetivo borrado con éxito

# errorEditarObjetivo
source: Could not edit the goal
es: No se pudo editar el objetivo

# errorSinConexionMensaje
source: No internet connection. Message cannot be sent.
es: Sin conexión a internet. No se puede enviar el mensaje.

# errorEnviarMensaje
source: Message could not be sent
es: No se ha podido enviar el mensaje

# perfilActualizado
source: Profile updated
es: Perfil actualizado

# objetivoEditado
source: Goal edited
es: Objetivo editado

# porAutorEnFecha
source: By {autor} - {fecha}
es: Por {autor} - {fecha}

# inhala
source: Inhale
es: Inhalar

# retener
source: Hold
es: Retener

# exhala
source: Exhale
es: Exhalar

# errorEliminarObjetivo
source: Error deleting goal
es: Error al eliminar objetivo

# objetivoEditadoExito
source: Goal successfully edited
es: Objetivo editado con exito

# editarPerfil
source: Edit profile
es: Editar perfil

# confirmarBorrado
source: Are you sure?
es: ¿Estás seguro?

# mensajeConfirmarBorradoObjetivo
source: Are you sure you want to delete this goal? This action cannot be undone.
es: ¿Estás seguro de que quieres borrar este objetivo? Esta acción no se puede deshacer.

# confirmarCerrarSesion
source: Log out?
es: ¿Cerrar sesión?

# mensajeConfirmarCerrarSesion
source: Are you sure you want to log out? You will need to log in again to continue.
es: ¿Estás seguro de que quieres cerrar sesión? Tendrás que iniciar sesión de nuevo para continuar.

# sinConexion
source: No internet connection
es: Sin conexión a internet

# intentaMasTarde
source: Please check your connection and try again
es: Por favor, revisa tu conexión e inténtalo de nuevo.

# minutosMinusculaPlural
source: minutes
es: minutos

# horaMinusculaSingular
source: hour
es: hora

# horasMinusculaPlural
source: hours
es: horas

# diaMinusculaSingular
source: day
es: día

# diasMinusculaPlural
source: days
es: días

# menosDeUnMinutoMinuscula
source: less than a minute
es: menos de un minuto

# minutoMinusculaSingular
source: minute
es: minuto

# emailEnUso
source: The email address is already in use.
es: El correo electrónico ya está en uso.

# usuarioEnUso
source: The username is already in use.
es: El nombre de usuario ya está en uso.

# errorConexion
source: Check your internet connection.
es: Comprueba la conexión.

# revisaCorreoyContrasenia
source: Check email and password
es: Revisa el correo y la contraseña

# porfavorIngreseUsuarioYContrasenia
source: Please enter your username and password
es: Por favor, ingrese el usuario y la contraseña

# noSePudoObtenerElUsuarioActual
source: Could not obtain the current user
es: No se pudo obtener el usuario actual

# temaOscuroActivo
source: Dark theme activated
es: Tema oscuro activado

# temaClaroActivo
source: Clear theme activated
es: Tema oscuro activado
